In [8]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'0.22.0'

### Create Pandas Series

In [7]:
# Pandas Series using List

lst = ['A','B','C','D','E']
sr = pd.Series(lst)
sr

0    A
1    B
2    C
3    D
4    E
dtype: object

In [12]:
# Pandas Series using numpy array

arr = np.array(['A','B','C','D','E'])
sr = pd.Series(arr)
sr

0    A
1    B
2    C
3    D
4    E
dtype: object

In [13]:
# Pandas Series using index

pd.Series(data = ['A','B','C','D','E'], index = [1,2,3,4,5])

1    A
2    B
3    C
4    D
5    E
dtype: object

In [16]:
# Pandas Series using Dictionary

dct = {'name' : 'Sneha', 'age' : '24', 'Blood group' : 'A+'}
steps = {'day1' : 10500, 'day2' : 2000, 'day3' : 10233}
pd.Series(dct)

Blood group       A+
age               24
name           Sneha
dtype: object

In [17]:
pd.Series(5)

0    5
dtype: int64

In [18]:
pd.Series(5).repeat(10)

0    5
0    5
0    5
0    5
0    5
0    5
0    5
0    5
0    5
0    5
dtype: int64

In [19]:
pd.Series(5).repeat(10).reset_index()

   index  0
0      0  5
1      0  5
2      0  5
3      0  5
4      0  5
5      0  5
6      0  5
7      0  5
8      0  5
9      0  5

In [21]:
pd.Series(5).repeat(10).reset_index(drop = True)

0    5
1    5
2    5
3    5
4    5
5    5
6    5
7    5
8    5
9    5
dtype: int64

In [23]:
pd.Series([2,3]).repeat([5,2])

0    2
0    2
0    2
0    2
0    2
1    3
1    3
dtype: int64

#### Aggregate Function for min, max, sum

In [30]:
# Aggregate function for some values

sr = pd.Series([10,20,30,40,50,60,70,80])
sr.agg([max])
sr.agg([min,max,sum])

min     10
max     80
sum    360
dtype: int64

### Absolute Function

In [31]:
sr = pd.Series([-1,2,3,-4,-5,-10,-334])
sr.abs()

0      1
1      2
2      3
3      4
4      5
5     10
6    334
dtype: int64

### Append series

In [34]:
sr1 = pd.Series(['a','b','c'])
sr2 = pd.Series(['A','B','C'])

sr1.append(sr2).reset_index(drop = True)

0    a
1    b
2    c
3    A
4    B
5    C
dtype: object

### Astype function   -   Change data type of series

In [40]:
sr1 = pd.Series([10,20,30,40,50,60,70,80])
sr1.astype(float)

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
5    60.0
6    70.0
7    80.0
dtype: float64

### Between function  -  Returns the values between

In [42]:
sr1.between(10,50)

0     True
1     True
2     True
3     True
4     True
5    False
6    False
7    False
dtype: bool

### Functions for string data

In [44]:
ser = pd.Series(['Sneha','Savi','Ashish','Sara','Arav'])
ser

0     Sneha
1      Savi
2    Ashish
3      Sara
4      Arav
dtype: object

In [46]:
ser.str.upper()

0     SNEHA
1      SAVI
2    ASHISH
3      SARA
4      ARAV
dtype: object

In [47]:
ser.str.lower()

0     sneha
1      savi
2    ashish
3      sara
4      arav
dtype: object

In [48]:
len(ser[1])

4

In [54]:
ser = pd.Series(['   Sneha','Savi   ' ,'   Ashish','Sara','Arav'])
ser = ser.str.strip()

In [55]:
len(ser[1])

4

In [59]:
ser = pd.Series(['Sneha','Savi','Ashish','Sara','Arav'])
ser.str.split('a')

0    [Sneh, ]
1     [S, vi]
2    [Ashish]
3    [S, r, ]
4     [Ar, v]
dtype: object

In [61]:
ser.str.contains('Sa')

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [62]:
ser.str.replace('S','A')

0     Aneha
1      Aavi
2    Ashish
3      Aara
4      Arav
dtype: object

In [64]:
ser.str.count('S')

0    1
1    1
2    0
3    1
4    0
dtype: int64

In [65]:
ser.str.endswith('v')

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [66]:
ser.str.startswith('S')

0     True
1     True
2    False
3     True
4    False
dtype: bool

In [67]:
ser.str.find('Sne')

0    0
1   -1
2   -1
3   -1
4   -1
dtype: int64

In [71]:
# Convert to a list

list(ser)

['Sneha', 'Savi', 'Ashish', 'Sara', 'Arav']

# DataFrame

### Creating DatFrame using List

In [77]:
lst = [['Sneha','24','90'],
       ['Jk','27','95'],
       ['Tom','21','80'],
       ['Jerry','18','85'],
       ['Timothy','23','78']]
df1 = pd.DataFrame(lst)
df1

         0   1   2
0    Sneha  24  90
1       Jk  27  95
2      Tom  21  80
3    Jerry  18  85
4  Timothy  23  78

### Creating DatFrame using Dictionary

In [78]:
dct = {'Name'  : ['Sneha','Savi','Tom','Jerry','JK','Timothy'],
       'Age'   : [24,27,21,18,27,23],
       'Marks' : [90,92,89,78,95,81]}
df2 = pd.DataFrame(dct)
df2

   Age  Marks     Name
0   24     90    Sneha
1   27     92     Savi
2   21     89      Tom
3   18     78    Jerry
4   27     95       JK
5   23     81  Timothy

### Slicing

In [82]:
# Print a column

df2[['Name']]

      Name
0    Sneha
1     Savi
2      Tom
3    Jerry
4       JK
5  Timothy

In [83]:
df1[[0]]

         0
0    Sneha
1       Jk
2      Tom
3    Jerry
4  Timothy

In [84]:
df1.loc[0:2, 0:1]

       0   1
0  Sneha  24
1     Jk  27
2    Tom  21

In [86]:
df1.iloc[0:2, 0:1]
# In iloc, the end index is excluded unlike loc

       0
0  Sneha
1     Jk

In [89]:
df2.iloc[[1,3],[1,2]]

   Marks   Name
1     92   Savi
3     78  Jerry

In [106]:
# Slicing using conditions
df2['Marks']>80

0     True
1     True
2     True
3    False
4     True
5     True
Name: Marks, dtype: bool

### Add a column to DataFrame

In [121]:
df2

   Age  Marks     Name
0   24     90    Sneha
1   27     92     Savi
2   21     89      Tom
3   18     78    Jerry
4   27     95       JK
5   23     81  Timothy

In [122]:
# Using List

df2['Blood Group'] = ['A+','A+','AB+','O-','A+','O+']
df2

   Age  Marks     Name Blood Group
0   24     90    Sneha          A+
1   27     92     Savi          A+
2   21     89      Tom         AB+
3   18     78    Jerry          O-
4   27     95       JK          A+
5   23     81  Timothy          O+

In [125]:
# Using Series

new_col = pd.Series(['In','In','UN','UN','KR','EN'])
df2['Nationality'] = new_col
df2

   Age  Marks     Name Blood Group Nationality
0   24     90    Sneha          A+          In
1   27     92     Savi          A+          In
2   21     89      Tom         AB+          UN
3   18     78    Jerry          O-          UN
4   27     95       JK          A+          KR
5   23     81  Timothy          O+          EN

In [131]:
# using existing column with modifications

df2['Age+10'] = df2['Age'] + 10
df2

   Age  Marks     Name Blood Group Nationality  Age+10
0   24     90    Sneha          A+          In      34
1   27     92     Savi          A+          In      37
2   21     89      Tom         AB+          UN      31
3   18     78    Jerry          O-          UN      28
4   27     95       JK          A+          KR      37
5   23     81  Timothy          O+          EN      33

### Column Deletion

In [132]:
# Using del keyword

del df2['Age+10']
df2

   Age  Marks     Name Blood Group Nationality
0   24     90    Sneha          A+          In
1   27     92     Savi          A+          In
2   21     89      Tom         AB+          UN
3   18     78    Jerry          O-          UN
4   27     95       JK          A+          KR
5   23     81  Timothy          O+          EN

In [133]:
df2['Age+10'] = df2['Age'] + 10

# Using pop

df2.pop('Age+10')
df2

   Age  Marks     Name Blood Group Nationality
0   24     90    Sneha          A+          In
1   27     92     Savi          A+          In
2   21     89      Tom         AB+          UN
3   18     78    Jerry          O-          UN
4   27     95       JK          A+          KR
5   23     81  Timothy          O+          EN

### Add a row in dataFrame

In [148]:
df_A = {'Age': 23, 'Marks' : 89, 'Name' : 'Sara', 'Blood Group' : 'B-', 'Nationality' : 'JP'}
df2.append(df_A, ignore_index=True)

   Age  Marks     Name Blood Group Nationality
0   24     90    Sneha          A+          In
1   27     92     Savi          A+          In
2   21     89      Tom         AB+          UN
3   18     78    Jerry          O-          UN
4   27     95       JK          A+          KR
5   23     81  Timothy          O+          EN
6   23     89     Sara          B-          JP

### drop() function

In [157]:
dct = {'Name'  : ['Sneha','Savi','Tom','Jerry','JK','Timothy'],
       'Age'   : [24,27,21,18,27,23],
       'Marks' : [90,92,89,78,95,81]}
df_1 = pd.DataFrame(dct)
df_1

   Age  Marks     Name
0   24     90    Sneha
1   27     92     Savi
2   21     89      Tom
3   18     78    Jerry
4   27     95       JK
5   23     81  Timothy

In [168]:
df_1.drop([2,4] , axis = 0)
# This does not change the original DataFrame

   Age  Marks     Name
0   24     90    Sneha
1   27     92     Savi
3   18     78    Jerry
5   23     81  Timothy

In [169]:
df_1.drop(['Marks'], axis=1)
# This does not change the original DataFrame

   Age     Name
0   24    Sneha
1   27     Savi
2   21      Tom
3   18    Jerry
4   27       JK
5   23  Timothy

### Transpose of DataFrame

In [171]:
df_1.T

           0     1    2      3   4        5
Age       24    27   21     18  27       23
Marks     90    92   89     78  95       81
Name   Sneha  Savi  Tom  Jerry  JK  Timothy

### Other Function on dataFrame

In [173]:
df1

         0   1   2
0    Sneha  24  90
1       Jk  27  95
2      Tom  21  80
3    Jerry  18  85
4  Timothy  23  78

In [174]:
df1.axes

[RangeIndex(start=0, stop=5, step=1), RangeIndex(start=0, stop=3, step=1)]

In [175]:
df1.ndim

2

In [178]:
df1.dtypes

0    object
1    object
2    object
dtype: object

In [179]:
df1.shape

(5, 3)

In [181]:
df1.head()

         0   1   2
0    Sneha  24  90
1       Jk  27  95
2      Tom  21  80
3    Jerry  18  85
4  Timothy  23  78

In [182]:
df1.tail()

         0   1   2
0    Sneha  24  90
1       Jk  27  95
2      Tom  21  80
3    Jerry  18  85
4  Timothy  23  78

In [184]:
df1.head(2)

       0   1   2
0  Sneha  24  90
1     Jk  27  95

In [185]:
df.tail(2)

         0   1   2
3    Jerry  18  85
4  Timothy  23  78

In [186]:
df.empty

False

### Statestical or Mathematical functions

In [195]:
lst = [[10, 111, 200, 1],
       [20, 126, 200, 2],
       [30, 162, 250, 3],
       [40, 133, 200, 4],
       [50, 127, 350, 5]]
df = pd.DataFrame(lst)
df

    0    1    2  3
0  10  111  200  1
1  20  126  200  2
2  30  162  250  3
3  40  133  200  4
4  50  127  350  5

In [196]:
df.sum()

0     150
1     659
2    1200
3      15
dtype: int64

In [197]:
df.mean()

0     30.0
1    131.8
2    240.0
3      3.0
dtype: float64

In [198]:
df.median()

0     30.0
1    127.0
2    200.0
3      3.0
dtype: float64

In [201]:
df[2].mode()

0    200
dtype: int64

In [202]:
df.var()

0     250.0
1     350.7
2    4250.0
3       2.5
dtype: float64

In [203]:
df.min()

0     10
1    111
2    200
3      1
dtype: int64

In [204]:
df.max()

0     50
1    162
2    350
3      5
dtype: int64

In [205]:
df.std()

0    15.811388
1    18.726986
2    65.192024
3     1.581139
dtype: float64

### Describe() Function

In [207]:
df.describe()

               0           1           2         3
count   5.000000    5.000000    5.000000  5.000000
mean   30.000000  131.800000  240.000000  3.000000
std    15.811388   18.726986   65.192024  1.581139
min    10.000000  111.000000  200.000000  1.000000
25%    20.000000  126.000000  200.000000  2.000000
50%    30.000000  127.000000  200.000000  3.000000
75%    40.000000  133.000000  250.000000  4.000000
max    50.000000  162.000000  350.000000  5.000000

### Pipe() Function

In [209]:
def add_(i,j):
    return i+j
def mul(i,j):
    return i*j

df.pipe(add_,10)

    0    1    2   3
0  20  121  210  11
1  30  136  210  12
2  40  172  260  13
3  50  143  210  14
4  60  137  360  15

In [210]:
df.pipe(add_,10).pipe(mul, 10)

     0     1     2    3
0  200  1210  2100  110
1  300  1360  2100  120
2  400  1720  2600  130
3  500  1430  2100  140
4  600  1370  3600  150

In [211]:
df[0].pipe(add_,2)

0    12
1    22
2    32
3    42
4    52
Name: 0, dtype: int64

### Apply() Function

In [212]:
# apply() and pipe() have similar purpose, but apply() can be used for whole DF only, not any specific rows or columns

df.apply(np.mean)

0     30.0
1    131.8
2    240.0
3      3.0
dtype: float64

In [214]:
df.apply(max)

0     50
1    162
2    350
3      5
dtype: int64

### Applymap() Function

In [215]:
df.applymap(lambda x : x**2)

      0      1       2   3
0   100  12321   40000   1
1   400  15876   40000   4
2   900  26244   62500   9
3  1600  17689   40000  16
4  2500  16129  122500  25

In [218]:
df.applymap(lambda x : x>20)

       0     1     2      3
0  False  True  True  False
1  False  True  True  False
2   True  True  True  False
3   True  True  True  False
4   True  True  True  False

### Reindex function

In [219]:
df

    0    1    2  3
0  10  111  200  1
1  20  126  200  2
2  30  162  250  3
3  40  133  200  4
4  50  127  350  5

In [224]:
# by default row-wise reindexing is done
df.reindex([1,3,4,2,0])

    0    1    2  3
1  20  126  200  2
3  40  133  200  4
4  50  127  350  5
2  30  162  250  3
0  10  111  200  1

In [225]:
df.reindex(columns = [3,2,1,0])

   3    2    1   0
0  1  200  111  10
1  2  200  126  20
2  3  250  162  30
3  4  200  133  40
4  5  350  127  50

### Rename function

In [248]:
lst = [[10, 111, 200, 1],
       [20, 126, 200, 2],
       [30, 162, 250, 3],
       [40, 133, 200, 4],
       [50, 127, 350, 5]]
df = pd.DataFrame(lst)
df.rename(columns = {0 : 'One', 1 : 'Two', 2 : 'Three', 3 : 'Four'}, inplace =True)
df.rename(index = {0:'a' , 1:'b' , 2:'c' , 3:'d' , 4:'e' }, inplace = True)
df

   One  Two  Three  Four
a   10  111    200     1
b   20  126    200     2
c   30  162    250     3
d   40  133    200     4
e   50  127    350     5

### Sorting

In [249]:
df.sort_values(by = 'Two')

   One  Two  Three  Four
a   10  111    200     1
b   20  126    200     2
e   50  127    350     5
d   40  133    200     4
c   30  162    250     3

In [250]:
# Descending order
df.sort_values(by = 'Two' , ascending = False)

   One  Two  Three  Four
c   30  162    250     3
d   40  133    200     4
e   50  127    350     5
b   20  126    200     2
a   10  111    200     1

### Groupby function

In [251]:
lst = [['NZ', 120, 200, 1],
       ['IN', 130, 200, 2],
       ['JP', 1160, 250, 3],
       ['IN', 120, 200, 4],
       ['NZ', 120, 350, 5]]
df = pd.DataFrame(lst)
df

    0     1    2  3
0  NZ   120  200  1
1  IN   130  200  2
2  JP  1160  250  3
3  IN   120  200  4
4  NZ   120  350  5

In [252]:
df.groupby(0)

In [253]:
df.groupby(0).groups

{'IN': Int64Index([1, 3], dtype='int64'),
 'JP': Int64Index([2], dtype='int64'),
 'NZ': Int64Index([0, 4], dtype='int64')}

In [254]:
df.groupby(2).groups

{200: Int64Index([0, 1, 3], dtype='int64'),
 250: Int64Index([2], dtype='int64'),
 350: Int64Index([4], dtype='int64')}

In [255]:
df.groupby(3).groups

{1: Int64Index([0], dtype='int64'),
 2: Int64Index([1], dtype='int64'),
 3: Int64Index([2], dtype='int64'),
 4: Int64Index([3], dtype='int64'),
 5: Int64Index([4], dtype='int64')}

In [259]:
# Search for a specific group
df.groupby([0,1]).get_group(('IN',130))

    0    1    2  3
1  IN  130  200  2